<a href="https://colab.research.google.com/github/Ro-netizen004/IntroToPandas/blob/main/Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np

my_series = [1,2,4,5]
my_var = pd.Series(my_series)
my_var

0    1
1    2
2    4
3    5
dtype: int64

In [7]:
#print specific value
my_var[3]

np.int64(5)

In [10]:
#labels using the index argument
my_index = ["A", "B", "C","D"]
my_var2 = pd.Series(my_series, index = my_index)
my_var2

A    1
B    2
C    4
D    5
dtype: int64

In [13]:
my_var2["B"]

np.int64(2)

In [15]:
#Key Value Dictionary
cars = { "Tesla":12, "Mercedes":42,"BMW": 3}
my_var3 = pd.Series(cars)
my_var3

Tesla       12
Mercedes    42
BMW          3
dtype: int64